---
type: RoutingCriterionBase
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# RoutingCriterionBase

`Autodesk.Revit.DB.RoutingCriterionBase` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsEqual | 2013 | `public bool IsEqual ( RoutingCriterionBase pOther )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |